XY = [
  0.1, -0.623;
  0.2, -0.431;
  0.3, -0.443;
  0.4, -0.275;
  0.5, -0.32;
  0.6, -0.297;
  0.7, -0.394;
  0.8, -0.388;
  0.9, -0.492;
  1.0, -0.698;
  ];

x = XY(:, 1);
y = XY(:, 2);

a11 = size(x, 1);
a12 = a21 = sum(x);
a13 = a22 = a31 = sum(x.^2);
a23 = a32 = sum(x.^3);
a33 = sum(x.^4);

b1 = sum(y);
b2 = sum(y.*x);
b3 = sum(y.*x.^2);

A = [a11, a12, a13; a21, a22, a23; a31, a32, a33];
B = [b1; b2; b3];
C = inv(A)*B;

hold on;
plot(x, y, 'o', "color", 'k');
plot(x, C(1) + C(2).*x + C(3).*x.*x, "color", 'r');

%C = pinv(x.'*x)*x.'*y % нормальное уравнение (линейное)
%plot(x, C(1) + C(2).*x + C(3).*x.*x, 'd', "color", 'b');
hold off;



