%D = dlmread('D.txt');        % пять спектров, D/l (нм)
E = dlmread('e_smooth.txt');  % пять спектров сглаженных, D/l/c (экстинция)

Xnm = E(:, 1);  % длина волны, нм
Ye = E(:, 2:6); % экстинция, D/l/C


Xc_1 = [661.15, 609.78, 560.78];
Xc_2 = [662.61, 617.44, 582.91];
Xc_3 = [663.21, 623.34, 574.36];
Xc_4 = [663.31, 626.60, 585.73];
Xc_5 = [663.57, 630.18, 595.62];


'Средние значения длин волн (нм) для трёх пиков:'
Xc = (Xc_1 + Xc_2 + Xc_3 + Xc_4 + Xc_5) ./ 5


figure(1);
SIGMA_1 = plot_three_gauss([-4], Xnm, Ye(:, 1), 1368, Xc_1, [34.10, 43.58, 36.38], [2022169, 2124700, 293374]);

figure(2);
SIGMA_2 = plot_three_gauss([3, -5], Xnm, Ye(:, 2), 1328, Xc_2, [31.81, 49.27, 81.41], [1876492, 1761168, 640029]);

figure(3);
SIGMA_3 = plot_three_gauss([-5], Xnm, Ye(:, 3), 1759, Xc_3, [30.21, 57.71, 92.69], [1759831, 2159913, 495032]);

figure(4);
SIGMA_4 = plot_three_gauss([3, -6], Xnm, Ye(:, 4), 3906, Xc_4, [29.79, 56.20, 76.04], [2087158, 2436650, 545198]);

figure(5);
SIGMA_5 = plot_three_gauss([-6], Xnm, Ye(:, 5), 7345, Xc_5, [29.59, 54.08, 68.70], [2161370, 2363300, 817473]);


'Средние значения сечений поглощения для трёх пиков:'
SIGMA = (SIGMA_1 + SIGMA_2 + SIGMA_3 + SIGMA_4 + SIGMA_5) ./ 5

