C = 6.0018 * 10.^(-6);


%D = dlmread('D_what.txt');
%X = 10.^(7) ./ D(:, 1);   % нм --> см^-1
%Y = D(:, 2:3) ./ C;       % D/l --> экстинция
%S = [X, Y];               % для origin
%save e_what.txt S;        % для origin



E = dlmread('e_what.txt');
X  = E(:, 1); % волновые числа, см^-1
Y1 = E(:, 2); % экстинция при C = 6.0018 * 10^-6
Y2 = E(:, 3); % экстинция при C = 9.6932 * 10^-6



Y = Y1; % берем спектр с меньшей конц-цией
Yo = 274;
Xc = [15093, 16026, 17722];
W = [666, 1511, 3113];
A = [40352000, 60917600, 27988000];

%plot_three_gauss([6, -6], X, Y, Yo, Xc, W, A, [-0.01, 0.06], 13000:1000:20000);



gaussian = @(x, k) A(1, k) * exp(-2 * ((x - Xc(1, k)) ./ W(1, k)).^2) ./ W(1, k) ./ sqrt(pi./2) + Yo;

Y1 = @(x) gaussian(x, 1);
Y2 = @(x) gaussian(x, 2);
Y3 = @(x) gaussian(x, 3);
Ysum = @(x) Y1(x) + Y2(x) + Y3(x) - 2*Yo;

Xmin = min(X);
Xmax = max(X);

S = [
  integral(Y1, Xmin, Xmax),
  integral(Y2, Xmin, Xmax),
  integral(Y3, Xmin, Xmax)
]
S = [
  integral(Ysum, Xmin, Xmax),
  integral(Ysum, Xmin, Xmax),
  integral(Ysum, Xmin, Xmax)
]


n = 1.33;               % показатель преломления
g = 9*n / (n*n + 2).^2  % эмпирический фактор

c = 3 * 10.^(10);      % скорость света (см/с)
m = 9.109 * 10.^(-28); % масса электрона (г)
e = 4.803 * 10.^(-10); % заряд электрона (СГС заряда)
N = 6.022 * 10.^(23);  % число Авогадро (безразмер., 1/моль)


Ao_v = @(k) Xc(1, k).^2 * (8*pi*pi*e*e) / (3*m*c); % вероятности перехода классического осциллятора
Ao = [
  Ao_v(1),
  Ao_v(2),
  Ao_v(3)
]


((m*c*c) / (pi*e*e*N)) * (log(10)*10.^3)
%f_s = @(k) ((3*m*c*c) / (pi*e*e)) * (2.3 / N) * g * S(k, 1);  % сила осциллятора
f_s = @(k) ((m*c*c) / (pi*e*e*N)) * (log(10)*10.^3) * g * S(k, 1);
%f_s = @(k) 4.32 * 10.^(-9) * g * S(k, 1);
f = [
  f_s(1),
  f_s(2),
  f_s(3)
]


tau_v = @(k) 1 / f(k, 1) / Ao(k, 1);  % время жизни
%tau_v = @(k) (3.5 * 10.^8) / Xc(1, k).^2 / S(k, 1);
tau = [
  tau_v(1),
  tau_v(2),
  tau_v(3)
]







