


% НЕ ДОВЕДЕНО ДО УМА!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!



% Прямой метод расчета хода луча (параксиальная оптика)
a_i = @(i, a, h, n, r) (a(i-1)*n(i-1)/n(i)) + (h(i-1)*(1 - (n(i-1)/n(i)))/r(i-1)); % угол луча
h_i = @(i, a, h, d) h(i-1) - a(i)*d(i-1);                                          % высота луча

% хроматический параметр
C_i = @(i, a, n, n_f, n_c) (a(i+1) - a(i))*(((n_f(i+1) - n_c(i+1))/n(i+1)) - ((n_f(i) - n_c(i))/n(i))) / ((1/n(i+1)) - (1/n(i)));

% для первой хроматической суммы Sch
S_i = @(i, a, h, n, n_f, n_c) C_i(i, a, n, n_f, n_c) * h(i);

% положение задней фокальной плоскости и задний фокальный отрезок
_f  = @(a, h) h(1)/a(end);
_Sf = @(a, h) h(end)/a(end);

%потом взять одинаковые стекла для ахроматической пары (две линзы, устраняющие хроматизм положения)
%при обратном ходе луча все знаки меняются для преломляющих поверхностей



% Параметры оптической системы (ахроматическая пара из К8 и ТФ5)
R = [105.68; -94.84; -88.31; -167.49];
d = [6.0; 0.3; 3.4];
Ne = [1; 1.518296; 1; 1.761614; 1]; % 546нм (линия Hg)
Nf = [1; 1.522407; 1; 1.776432; 1]; % ~480нм
Nc = [1; 1.514291; 1; 1.748558; 1]; % ~650нм



c = length(R)+1;
a = zeros(c, 1);
h = ones(c-1, 1);
s = zeros(c-1, 1);


for i=2:(c-1)
  a(i) = a_i(i, a, h, Ne, R);
  h(i) = h_i(i, a, h, d);
endfor

a(c) = a_i(c, a, h, Ne, R);

a
h

for i=1:(c-1)
  s(i) = S_i(i, a, h, Ne, Nf, Ne);
endfor

_f(a, h).^2 * sum(s)
